# Завдання 1
#=================================================================================================
# Використовуючи стеки, змоделюйте роботу над виконанням проекту.
# Як відомо складні завдання часто розбивають на під задачі в процесі роботи, і тільки коли всі
# вони виконані вважається що з основним завданням ви впорались.
# Створіть клас Project
# Атрибути:
# tasks – стек з завданнями, об’єкти класу Task (початкове завдання передається в init)
# Методи:
# do_task() – видалити останнє завдання з стеку та виконати його, якщо для цього потрібно зробити під завдання, то добавити їх у стек
# Якщо стек порожній то вивести про це повідомлення
# is_finished() – True якщо завдань не залишилось
# Клас Task(уже реалізований):
# do() – виконує завдання(виводить на екран інформацію про це) та повертає список з підзавданням для успішного виконаня
from queue import LifoQueue


class Task:
    def __init__(self, name):
        self.name = name
        self.subtasks = []

    def do(self):
        """
        Виконує завдання, за потреби розбиває його на підзавдання
        :return: список підзавдань
        """
        if self.subtasks:
            print(f"Виконую завдання: {self.name}. Розбиваю на підзавдання")
        else:
            print(f"Завершено завдання: {self.name}")

        return self.subtasks


class Project:
    def __init__(self, start_task):
        self.tasks = LifoQueue()
        self.tasks.put(start_task)

    def do_task(self):
        if self.tasks.empty():
            print("Немає завдань для виконання")
            return

        last_task = self.tasks.get()
        subtasks = last_task.do()

        for subtask in subtasks:
            self.tasks.put(subtask)

    def is_finished(self):
        if self.tasks.empty():
            print("Всi завдання виконано")
            return True

        return False


task = Task('Підготовка до зйомок')

task.subtasks = [
    Task('Пошук локацій'),
    Task('Підготовка сценарію'),
    Task('Кастинг акторів')
]

# Підзавдання для "Пошук локацій"
task.subtasks[0].subtasks = [
    Task('Огляд локацій у місті'),
    Task('Огляд локацій за містом'),
    Task('Узгодження місць для зйомок')
]

# Підзавдання для "Підготовка сценарію"
task.subtasks[1].subtasks = [
    Task('Написання основного сценарію'),
    Task('Редагування сценарію'),
    Task('Підготовка сценарних приміток'),
]

# Підзавдання для "Кастинг акторів"
task.subtasks[2].subtasks = [
    Task('Пошук головних акторів'),
    Task('Пошук другорядних акторів'),
    Task('Підготовка контрактів для акторів')
]

# Підзавдання для "Пошук локацій у місті"
task.subtasks[0].subtasks[0].subtasks = [
    Task('Вибір декорацій для зйомок'),
    Task('Узгодження з власниками приміщень')
]

# Підзавдання для "Огляд локацій за містом"
task.subtasks[0].subtasks[1].subtasks = [
    Task('Вибір лісу для сцени битви'),
    Task('Пошук старовинних будівель для сцени'),
]

# Підзавдання для "Написання основного сценарію"
task.subtasks[1].subtasks[0].subtasks = [
    Task('Написання першої частини'),
    Task('Написання другої частини'),
]

# Підзавдання для "Пошук головних акторів"
task.subtasks[2].subtasks[0].subtasks = [
    Task('Пошук актора на роль головного героя'),
    Task('Пошук актриси на роль головної героїні')
]

project = Project(task)

while not project.is_finished():
    project.do_task()